balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ32MC204.PIC
        <edc:AdjustPoint edc:offset="654"/>
        <edc:SFRDef edc:access="n-n-----nnnnnnnn" edc:cname="P2TCON" edc:desc="" edc:impl="0xe0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0-----00000000" edc:name="P2TCON" edc:nzwidth="0x10" edc:por="0-0-----00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PTMOD" edc:desc="" edc:mask="0x3" edc:name="PTMOD" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PTCKPS" edc:desc="" edc:mask="0x3" edc:name="PTCKPS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PTOPS" edc:desc="" edc:mask="0xf" edc:name="PTOPS" edc:nzwidth="4"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="PTSIDL" edc:desc="" edc:mask="0x1" edc:name="PTSIDL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PTEN" edc:desc="" edc:mask="0x1" edc:name="PTEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PTMOD0" edc:desc="" edc:mask="0x1" edc:name="PTMOD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTMOD1" edc:desc="" edc:mask="0x1" edc:name="PTMOD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTCKPS0" edc:desc="" edc:mask="0x1" edc:name="PTCKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTCKPS1" edc:desc="" edc:mask="0x1" edc:name="PTCKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTOPS0" edc:desc="" edc:mask="0x1" edc:name="PTOPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTOPS1" edc:desc="" edc:mask="0x1" edc:name="PTOPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTOPS2" edc:desc="" edc:mask="0x1" edc:name="PTOPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTOPS3" edc:desc="" edc:mask="0x1" edc:name="PTOPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:FreezeBit edc:freezeval="1" edc:name="PWM2" edc:pos="0xe"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rnnnnnnnnnnnnnnn" edc:cname="P2TMR" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="P2TMR" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PTMR" edc:desc="" edc:mask="0x7fff" edc:name="PTMR" edc:nzwidth="0xf"/>
              <edc:SFRFieldDef edc:cname="PTDIR" edc:desc="" edc:mask="0x1" edc:name="PTDIR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnnnnnnnnnn" edc:cname="P2TPER" edc:desc="" edc:impl="0x7fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000000000000000" edc:name="P2TPER" edc:nzwidth="0x10" edc:por="-000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PTPER" edc:desc="" edc:mask="0x7fff" edc:name="PTPER" edc:nzwidth="0xf"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="P2SECMP" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="P2SECMP" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEVTCMP" edc:desc="" edc:mask="0x7fff" edc:name="SEVTCMP" edc:nzwidth="0xf"/>
              <edc:SFRFieldDef edc:cname="SEVTDIR" edc:desc="" edc:mask="0x1" edc:name="SEVTDIR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------n---n---n" edc:cname="PWM2CON1" edc:desc="" edc:impl="0x111" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0---0---0" edc:name="PWM2CON1" edc:nzwidth="0x10" edc:por="-------0---0---0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PEN1L" edc:desc="" edc:mask="0x1" edc:name="PEN1L" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="PEN1H" edc:desc="" edc:mask="0x1" edc:name="PEN1H" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="PMOD1" edc:desc="" edc:mask="0x1" edc:name="PMOD1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn-----nnn" edc:cname="PWM2CON2" edc:desc="" edc:impl="0xf07" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000-----000" edc:name="PWM2CON2" edc:nzwidth="0x10" edc:por="----0000-----000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="UDIS" edc:desc="" edc:mask="0x1" edc:name="UDIS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OSYNC" edc:desc="" edc:mask="0x1" edc:name="OSYNC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IUE" edc:desc="" edc:mask="0x1" edc:name="IUE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="SEVOPS" edc:desc="" edc:mask="0xf" edc:name="SEVOPS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="SEVOPS0" edc:desc="" edc:mask="0x1" edc:name="SEVOPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEVOPS1" edc:desc="" edc:mask="0x1" edc:name="SEVOPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEVOPS2" edc:desc="" edc:mask="0x1" edc:name="SEVOPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEVOPS3" edc:desc="" edc:mask="0x1" edc:name="SEVOPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="P2DTCON1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="P2DTCON1" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DTA" edc:desc="" edc:mask="0x3f" edc:name="DTA" edc:nzwidth="0x6"/>
              <edc:SFRFieldDef edc:cname="DTAPS" edc:desc="" edc:mask="0x3" edc:name="DTAPS" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="DTB" edc:desc="" edc:mask="0x3f" edc:name="DTB" edc:nzwidth="0x6"/>
              <edc:SFRFieldDef edc:cname="DTBPS" edc:desc="" edc:mask="0x3" edc:name="DTBPS" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DTA0" edc:desc="" edc:mask="0x1" edc:name="DTA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTA1" edc:desc="" edc:mask="0x1" edc:name="DTA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTA2" edc:desc="" edc:mask="0x1" edc:name="DTA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTA3" edc:desc="" edc:mask="0x1" edc:name="DTA3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTA4" edc:desc="" edc:mask="0x1" edc:name="DTA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTA5" edc:desc="" edc:mask="0x1" edc:name="DTA5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTAPS0" edc:desc="" edc:mask="0x1" edc:name="DTAPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTAPS1" edc:desc="" edc:mask="0x1" edc:name="DTAPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTB0" edc:desc="" edc:mask="0x1" edc:name="DTB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTB1" edc:desc="" edc:mask="0x1" edc:name="DTB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTB2" edc:desc="" edc:mask="0x1" edc:name="DTB2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTB3" edc:desc="" edc:mask="0x1" edc:name="DTB3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTB4" edc:desc="" edc:mask="0x1" edc:name="DTB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTB5" edc:desc="" edc:mask="0x1" edc:name="DTB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTBPS0" edc:desc="" edc:mask="0x1" edc:name="DTBPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTBPS1" edc:desc="" edc:mask="0x1" edc:name="DTBPS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------------nn" edc:cname="P2DTCON2" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00" edc:name="P2DTCON2" edc:nzwidth="0x10" edc:por="--------------00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DTS1I" edc:desc="" edc:mask="0x1" edc:name="DTS1I" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTS1A" edc:desc="" edc:mask="0x1" edc:name="DTS1A" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nnn------n" edc:cname="P2FLTACON" edc:desc="" edc:impl="0x381" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------000------0" edc:name="P2FLTACON" edc:nzwidth="0x10" edc:por="------000------0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FAEN1" edc:desc="" edc:mask="0x1" edc:name="FAEN1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="FLTAM" edc:desc="" edc:mask="0x1" edc:name="FLTAM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAOV1L" edc:desc="" edc:mask="0x1" edc:name="FAOV1L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAOV1H" edc:desc="" edc:mask="0x1" edc:name="FAOV1H" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="------nn------nn" edc:cname="P2OVDCON" edc:desc="" edc:impl="0x303" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------11------00" edc:name="P2OVDCON" edc:nzwidth="0x10" edc:por="------11------00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POUT1L" edc:desc="" edc:mask="0x1" edc:name="POUT1L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POUT1H" edc:desc="" edc:mask="0x1" edc:name="POUT1H" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="POVD1L" edc:desc="" edc:mask="0x1" edc:name="POVD1L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVD1H" edc:desc="" edc:mask="0x1" edc:name="POVD1H" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
